# 第十章：数据聚合与分组运算

 ## GroupyBy机制:分组运算（Split—Apply—Combine）

### 10.1 分组(Split)

#### 10.1.1 通过Series进行分组

以DataFrame数据集为例

In [53]:
import pandas as pd
import numpy as np
df = pd.DataFrame({'key1':['a',	'a',	'b',	'b',	'a'],
                   'key2':['one',	'two',	'one',	'two',	'one'],
                   'data1':np.random.randn(5),
                   'data2':np.random.randn(5)})

In [54]:
df

  key1 key2     data1     data2
0    a  one  0.517459  0.276264
1    a  two  0.213674  0.686762
2    b  one -0.055019 -1.263965
3    b  two -0.472214  0.946897
4    a  one  0.262051  1.667584

**1. 按照Series Key1进行分组，同时计算data1的均值**

In [55]:
group1=df["data1"].groupby(df["key1"])
group1.mean()

key1
a    0.331061
b   -0.263616
Name: data1, dtype: float64

**2. 传入多个Series Key1,Key2进行分组，同时计算data1的均值**

In [56]:
group2=df["data1"].groupby([df["key1"],df["key2"]]) #易错：这里两个df外还需加个[ ]
group2.mean()

key1  key2
a     one     0.389755
      two     0.213674
b     one    -0.055019
      two    -0.472214
Name: data1, dtype: float64

#### 10.1.2 通过任意数组进行分组

In [57]:
states	=	np.array(['Ohio',	'California',	'California',	'Ohio',	'Ohio'])
years	=	np.array([2005,	2005,	2006,	2005,	2006])
df["data1"].groupby([states,years]).mean()

California  2005    0.213674
            2006   -0.055019
Ohio        2005    0.022623
            2006    0.262051
Name: data1, dtype: float64

#### 10.1.3 通过列名进行分组

In [58]:
df.groupby('key1').mean() #df数据按照key1中的元素名a,b进行分组

         data1     data2
key1
a     0.331061  0.876870
b    -0.263616 -0.158534

这里由于key2不是数值列，因此被忽略

**groupby( ).size( )可以返回一个含有分组大小的Series**

In [59]:
# Eg1
df.groupby('key1').size()

key1
a    3
b    2
dtype: int64

In [60]:
# Eg2
df.groupby(['key1','key2']).size()

key1  key2
a     one     2
      two     1
b     one     1
      two     1
dtype: int64

 **对分组对象进行迭代(分组名+数据块）**

1.对一列数据'key1'进行迭代

In [61]:
for name,group in df.groupby('key1'):
    print(name)
    print(group)

a
  key1 key2     data1     data2
0    a  one  0.517459  0.276264
1    a  two  0.213674  0.686762
4    a  one  0.262051  1.667584
b
  key1 key2     data1     data2
2    b  one -0.055019 -1.263965
3    b  two -0.472214  0.946897

这里分组名name为'a'，'b'后面跟着的就是数据块group，相当于根据'key1'中的元素'a'，'b'对数据模块进行拆分

2.对两列数据'key1','key2'进行迭代

In [62]:
for name,group in df.groupby(['key1','key2']):
    print(name)
    print(group)

('a', 'one')
  key1 key2     data1     data2
0    a  one  0.517459  0.276264
4    a  one  0.262051  1.667584
('a', 'two')
  key1 key2     data1     data2
1    a  two  0.213674  0.686762
('b', 'one')
  key1 key2     data1     data2
2    b  one -0.055019 -1.263965
('b', 'two')
  key1 key2     data1     data2
3    b  two -0.472214  0.946897

这里分组名name按照'key1'，'key2'中元素('a','b')和('one','two')进行组合，后面就是对应的group

3.对数据片段进行操作

In [63]:
pieces	=	dict(list(df.groupby('key1'))) #将分组模块转化为字典
pieces

{'a':   key1 key2     data1     data2
 0    a  one  0.517459  0.276264
 1    a  two  0.213674  0.686762
 4    a  one  0.262051  1.667584,
 'b':   key1 key2     data1     data2
 2    b  one -0.055019 -1.263965
 3    b  two -0.472214  0.946897}

**对列进行分组**

$\color{red}{注意：如果按照列分类，需加axis=1}$

In [64]:
df.dtypes #key1,key2为非数值型；data1，data2为数值型

key1      object
key2      object
data1    float64
data2    float64
dtype: object

In [65]:
grouped=df.groupby(df.dtypes, axis=1)

In [66]:
for name, group in grouped:
    print(name)
    print(group)

float64
      data1     data2
0  0.517459  0.276264
1  0.213674  0.686762
2 -0.055019 -1.263965
3 -0.472214  0.946897
4  0.262051  1.667584
object
  key1 key2
0    a  one
1    a  two
2    b  one
3    b  two
4    a  one

这样就可以根据列表数据的类型，对列进行分类

**对部分列进行聚合**

仅对data1列进行聚合处理

In [67]:
df['data1'].groupby([df['key1'],df['key2']]).mean()

key1  key2
a     one     0.389755
      two     0.213674
b     one    -0.055019
      two    -0.472214
Name: data1, dtype: float64

仅对data2列进行聚合处理

In [68]:
df['data2'].groupby([df['key1'],df['key2']]).mean()

key1  key2
a     one     0.971924
      two     0.686762
b     one    -1.263965
      two     0.946897
Name: data2, dtype: float64

#### 10.1.4 通过字典进行分组

In [69]:
people = pd.DataFrame(np.random.randn(5,5),
columns=['a','b','c','d','e'],
index=['Joe','Steve','Wes','Jim','Travis'])

In [70]:
people

               a         b         c         d         e
Joe     0.749061  1.530169 -0.657455  1.081010 -0.949673
Steve  -1.094873 -1.562194 -0.430412  0.522492  0.415165
Wes     0.561242  0.242438 -0.921211 -0.260106 -1.329008
Jim    -0.223519  0.236733 -0.477450 -0.787666  2.933840
Travis -2.393750 -0.016350 -2.178502 -1.029582  1.343724

In [71]:
#Eg1: 构造一个字典，建立新的分组关系，按列进行分组
mapping={"a":"red",'b':'blue','c':'red','d':'red','e':'blue'}

In [72]:
people.groupby(mapping,axis=1).mean()

            blue       red
Joe     0.290248  0.390872
Steve  -0.573514 -0.334264
Wes    -0.543285 -0.206692
Jim     1.585286 -0.496212
Travis  0.663687 -1.867278

这里重新构造了一个分组关系，将列分为blue和red

In [73]:
#Eg2: 构造一个字典，建立新的分组关系，按行进行分组
mapping2={"Joe":"man",'Steve':'man','Wes':'Woman','Jim':'man','Travis':'Woman'}

In [74]:
people.groupby(mapping2).mean()

              a         b         c         d         e
Woman -0.916254  0.113044 -1.549857 -0.644844  0.007358
man   -0.189777  0.068236 -0.521772  0.271945  0.799777

这里重新构造一个分组关系，将人名按照man和woman进行划分

#### 10.1.5 通过函数进行分组

In [75]:
# Eg1：根据字符串长度length进行分类
people.groupby(len).mean()

          a         b         c         d         e
3  0.362261  0.669780 -0.685372  0.011079  0.218386
5 -1.094873 -1.562194 -0.430412  0.522492  0.415165
6 -2.393750 -0.016350 -2.178502 -1.029582  1.343724

$\color{red}{注意：函数，数组，字典，Series分类可以混用}$

In [76]:
# Eg:按照函数len和数组进行分类
people.groupby([len,["one",'one','two','one','two']]).mean()

              a         b         c         d         e
3 one  0.262771  0.883451 -0.567453  0.146672  0.992083
  two  0.561242  0.242438 -0.921211 -0.260106 -1.329008
5 one -1.094873 -1.562194 -0.430412  0.522492  0.415165
6 two -2.393750 -0.016350 -2.178502 -1.029582  1.343724

In [77]:
people.groupby([len,["one",'one','two','one','two']]).count()

       a  b  c  d  e
3 one  2  2  2  2  2
  two  1  1  1  1  1
5 one  1  1  1  1  1
6 two  1  1  1  1  1

#### 10.1.6 按照索引级别进行分组

$\color{red}{注意：索引关键词 level}$ xx.groupby(level='xxx')

In [78]:
# Eg：这里有两级索引，一级索引为cty，二级索引为tenor
columns=pd.MultiIndex.from_arrays([['US',	'US',	'US',	'JP',	'JP'],
[1,	3,5,1,3]],
names=['cty','tenor'])
hier_df=pd.DataFrame(np.random.randn(4,	5),	columns=columns)
hier_df

cty          US                            JP
tenor         1         3         5         1         3
0     -0.749544  0.557341 -0.798133 -0.228749  0.262851
1      0.360184 -0.359874 -0.258842  0.649850 -0.107479
2     -0.385740 -0.931676  1.473117 -0.570184 -0.415947
3     -1.088311  0.723029  0.883157  0.342441  0.349109

In [79]:
# 按照一级索引进行分组
hier_df.groupby(level='cty',axis=1).count()

cty  JP  US
0     2   3
1     2   3
2     2   3
3     2   3

In [80]:
# 按照二级索引进行分组
hier_df.groupby(level='tenor',axis=1).count()

tenor  1  3  5
0      2  2  1
1      2  2  1
2      2  2  1
3      2  2  1

***
**第一节总结：DataFrame数据分组方法**
   * 通过Series进行分组
   * 通过数组进行分组
   * 通过列名进行分组
   * 通过函数进行分组
   * 通过索引级别进行分组

### 10.2 聚合

**常见聚合函数：**
   * count：计数
   * sum：求和
   * mean：求均值
   * median：求中位数
   * std，var：标准差，方差
   * min，max：最小值，最大值
   * prod：求积
   * first，last：第一个，最后一个值

以上均不包括NA数据

**自定义聚合函数：**

需要将函数名传入aggregate或者agg

In [81]:
#Eg1：构建函数，用最大值减去最小值并应用于分组中
df=pd.DataFrame({'data1':np.random.randn(5),'data2':np.random.randn(5),'key1':['a','a','b','a','b'],'key2':['one','one','one','two','two']})
df

      data1     data2 key1 key2
0  0.393297  0.061274    a  one
1  0.851517 -2.160787    a  one
2  0.870223 -1.186377    b  one
3  1.816564 -0.599874    a  two
4  0.009595  0.020745    b  two

In [82]:
def f(x):
    return x.max()-x.min()

In [83]:
grouped=df.groupby('key1').agg(f)
grouped

         data1     data2
key1
a     1.423267  2.222061
b     0.860627  1.207122

 * * *

**面向列的多函数应用**

In [84]:
#首先导入数据，因为原始csv文件找不到，因此通过字典直接导入
tips=pd.read_csv("tips.csv")
tips['tip_pct']=tips['tip']/tips['total_bill']
tips

     total_bill   tip smoker   day    time  size   tip_pct
0         16.99  1.01     No   Sun  Dinner     2  0.059447
1         10.34  1.66     No   Sun  Dinner     3  0.160542
2         21.01  3.50     No   Sun  Dinner     3  0.166587
3         23.68  3.31     No   Sun  Dinner     2  0.139780
4         24.59  3.61     No   Sun  Dinner     4  0.146808
..          ...   ...    ...   ...     ...   ...       ...
239       29.03  5.92     No   Sat  Dinner     3  0.203927
240       27.18  2.00    Yes   Sat  Dinner     2  0.073584
241       22.67  2.00    Yes   Sat  Dinner     2  0.088222
242       17.82  1.75     No   Sat  Dinner     2  0.098204
243       18.78  3.00     No  Thur  Dinner     2  0.159744

[244 rows x 7 columns]

In [85]:
#按照'smoker'和'day'对数据进行分组
grouped=tips.groupby(['smoker','day'])

In [86]:
#我们选取列tip_pct进行分析
grouped_tip=grouped['tip_pct']

In [87]:
#分别使用函数'mean','sum','var',f对列进行分析
grouped_tip.agg(['mean','sum','var',f])

                 mean       sum       var         f
smoker day
No     Fri   0.151650  0.606602  0.000791  0.067349
       Sat   0.158048  7.112145  0.001581  0.235193
       Sun   0.160113  9.126438  0.001793  0.193226
       Thur  0.160298  7.213414  0.001503  0.193350
Yes    Fri   0.174783  2.621746  0.002631  0.159925
       Sat   0.147906  6.212055  0.003767  0.290095
       Sun   0.187250  3.557756  0.023757  0.644685
       Thur  0.163863  2.785676  0.001551  0.151240

$\color{red}{注意：这里内置函数名称需要加' '，自定义函数名称不需要}$

***

**面向多个列的多函数应用**

1. 对每一列分别应用相同的函数

In [88]:
#同时对两列tip,tip_pct进行聚合分析
result=grouped[['tip_pct','total_bill']].agg(['mean','var',f])
result

              tip_pct                     total_bill
                 mean       var         f       mean         var      f
smoker day
No     Fri   0.151650  0.000791  0.067349  18.420000   25.596333  10.29
       Sat   0.158048  0.001581  0.235193  19.661778   79.908965  41.08
       Sun   0.160113  0.001793  0.193226  20.506667   66.099980  39.40
       Thur  0.160298  0.001503  0.193350  17.113111   59.625081  33.68
Yes    Fri   0.174783  0.002631  0.159925  16.813333   82.562438  34.42
       Sat   0.147906  0.003767  0.290095  21.276667  101.387535  47.74
       Sun   0.187250  0.023757  0.644685  24.120000  109.046044  38.10
       Thur  0.163863  0.001551  0.151240  19.190588   69.808518  32.77

$\color{red}{注意：这里选取多列时候需要用list，即['tip pct','total bill']，不然会报错}$

这里的列名tip_pct和total_bill可用作索引

In [89]:
result['tip_pct']

                 mean       var         f
smoker day
No     Fri   0.151650  0.000791  0.067349
       Sat   0.158048  0.001581  0.235193
       Sun   0.160113  0.001793  0.193226
       Thur  0.160298  0.001503  0.193350
Yes    Fri   0.174783  0.002631  0.159925
       Sat   0.147906  0.003767  0.290095
       Sun   0.187250  0.023757  0.644685
       Thur  0.163863  0.001551  0.151240

In [90]:
result['total_bill']

                  mean         var      f
smoker day
No     Fri   18.420000   25.596333  10.29
       Sat   19.661778   79.908965  41.08
       Sun   20.506667   66.099980  39.40
       Thur  17.113111   59.625081  33.68
Yes    Fri   16.813333   82.562438  34.42
       Sat   21.276667  101.387535  47.74
       Sun   24.120000  109.046044  38.10
       Thur  19.190588   69.808518  32.77

***

2. 对不同的列应用不同的函数（引入字典对应）

In [91]:
#对两列tip_pct和total_bill分别应用不同的函数
result2=grouped[['tip_pct','total_bill']].agg({'tip_pct':['mean','var','max'],'total_bill':'median'})
result2

              tip_pct                     total_bill
                 mean       var       max     median
smoker day
No     Fri   0.151650  0.000791  0.187735     19.235
       Sat   0.158048  0.001581  0.291990     17.820
       Sun   0.160113  0.001793  0.252672     18.430
       Thur  0.160298  0.001503  0.266312     15.950
Yes    Fri   0.174783  0.002631  0.263480     13.420
       Sat   0.147906  0.003767  0.325733     20.390
       Sun   0.187250  0.023757  0.710345     23.100
       Thur  0.163863  0.001551  0.241255     16.470

***

**以没有行索引返回聚合数据**

as_index=False

In [92]:
tips.groupby(['smoker','day'],as_index=False).mean()

  smoker   day  total_bill       tip      size   tip_pct
0     No   Fri   18.420000  2.812500  2.250000  0.151650
1     No   Sat   19.661778  3.102889  2.555556  0.158048
2     No   Sun   20.506667  3.167895  2.929825  0.160113
3     No  Thur   17.113111  2.673778  2.488889  0.160298
4    Yes   Fri   16.813333  2.714000  2.066667  0.174783
5    Yes   Sat   21.276667  2.875476  2.476190  0.147906
6    Yes   Sun   24.120000  3.516842  2.578947  0.187250
7    Yes  Thur   19.190588  3.030000  2.352941  0.163863

### 10.3 一般性的拆分、应用、合并

In [93]:
#Eg1:编写一个函数
def top(df,n=6):
    return df.sort_values('tip_pct')[-n:]

In [94]:
#分组完后通过apply应用
tips.groupby('smoker').apply(top,n=4)

            total_bill   tip smoker   day    time  size   tip_pct
smoker
No     185       20.69  5.00     No   Sun  Dinner     5  0.241663
       51        10.29  2.60     No   Sun  Dinner     2  0.252672
       149        7.51  2.00     No  Thur   Lunch     2  0.266312
       232       11.61  3.39     No   Sat  Dinner     2  0.291990
Yes    183       23.17  6.50    Yes   Sun  Dinner     4  0.280535
       67         3.07  1.00    Yes   Sat  Dinner     1  0.325733
       178        9.60  4.00    Yes   Sun  Dinner     2  0.416667
       172        7.25  5.15    Yes   Sun  Dinner     2  0.710345

先根据smoker进行分类，'yes'和'no'两类分别应用函数top

In [95]:
tips.groupby(['smoker','day']).apply(top,n=1)

                 total_bill   tip smoker   day    time  size   tip_pct
smoker day
No     Fri  223       15.98  3.00     No   Fri   Lunch     3  0.187735
       Sat  232       11.61  3.39     No   Sat  Dinner     2  0.291990
       Sun  51        10.29  2.60     No   Sun  Dinner     2  0.252672
       Thur 149        7.51  2.00     No  Thur   Lunch     2  0.266312
Yes    Fri  93        16.32  4.30    Yes   Fri  Dinner     2  0.263480
       Sat  67         3.07  1.00    Yes   Sat  Dinner     1  0.325733
       Sun  172        7.25  5.15    Yes   Sun  Dinner     2  0.710345
       Thur 194       16.58  4.00    Yes  Thur   Lunch     2  0.241255

***

**禁止分组键**

即取消分组键构成的层次化索引

In [96]:
tips.groupby(['smoker','day'],group_keys=False).apply(top,n=1)

     total_bill   tip smoker   day    time  size   tip_pct
223       15.98  3.00     No   Fri   Lunch     3  0.187735
232       11.61  3.39     No   Sat  Dinner     2  0.291990
51        10.29  2.60     No   Sun  Dinner     2  0.252672
149        7.51  2.00     No  Thur   Lunch     2  0.266312
93        16.32  4.30    Yes   Fri  Dinner     2  0.263480
67         3.07  1.00    Yes   Sat  Dinner     1  0.325733
172        7.25  5.15    Yes   Sun  Dinner     2  0.710345
194       16.58  4.00    Yes  Thur   Lunch     2  0.241255

***

**分位数和桶分析**

1. 构造长度相同的桶进行分析

In [97]:
frame=pd.DataFrame({'data1':np.random.randn(1000),'data2':np.random.randn(1000)})
quartiles=pd.cut(frame['data1'],4)#将随机数最大，最小值间等分为4个区间

In [98]:
def get_stat(x):
    return {'min':x.min(),'max':x.max(),'mean':x.mean(),'median':x.median(),'count':x.count()}

In [99]:
grouped=frame['data2'].groupby(quartiles) #根据以上四个区间对data2数据进行分类
grouped.apply(get_stat).unstack()#定义统计函数对data2进行分析

                       min       max      mean    median  count
data1
(-2.92, -1.428]  -2.884240  2.521424  0.070643 -0.014895   74.0
(-1.428, 0.0584] -3.370223  2.691838 -0.057307 -0.047803  491.0
(0.0584, 1.545]  -3.024090  2.914028 -0.007079  0.091217  371.0
(1.545, 3.031]   -2.121494  2.172128  0.174280  0.138567   64.0

***

2. 构造大小相等的桶进行分析（分位数）

In [100]:
quartiles_qcut=pd.qcut(frame['data1'],4)#边界值为4个分位数，而不是等分区间
grouped=frame['data2'].groupby(quartiles_qcut) 
grouped.apply(get_stat).unstack()

                       min       max      mean    median  count
data1
(-2.916, -0.709] -3.370223  2.691838  0.012696  0.002061  250.0
(-0.709, -0.115] -2.278094  2.390940 -0.110242 -0.139298  250.0
(-0.115, 0.614]  -2.756511  2.475591 -0.024070  0.038360  250.0
(0.614, 3.031]   -3.024090  2.914028  0.064086  0.132968  250.0

***

**示例1：用特定分组的值填补NAN**

1. 用相同的值去填充

In [101]:
s=pd.Series(np.random.randn(6))

In [102]:
s[:2]=np.nan
s

0         NaN
1         NaN
2   -0.693691
3   -1.566444
4    1.446501
5    1.046831
dtype: float64

In [103]:
s.fillna(s.mean())#用均值去填充nan

0    0.058299
1    0.058299
2   -0.693691
3   -1.566444
4    1.446501
5    1.046831
dtype: float64

2. 分组后用不同的值去填充

用各组的平均值去填充

In [104]:
states = ['Ohio','NewYork','Vermont','Florida',
'Oregon','Nevada','California','Idaho']

In [105]:
data = pd.Series(np.random.randn(8),index=states)
data[['Ohio','Vermont','California']]=np.nan #赋值NAN
data

Ohio               NaN
NewYork      -0.324173
Vermont            NaN
Florida      -1.566234
Oregon       -0.888214
Nevada       -1.142484
California         NaN
Idaho         1.617798
dtype: float64

In [106]:
key=['West']*4+['East']*4 #构造分组数组

In [107]:
#定义函数后apply
fill= lambda x:x.fillna(x.mean())

In [108]:
grouped_key = data.groupby(key).apply(fill)
grouped_key #用分组后各组的平均值去填充

Ohio         -0.945204
NewYork      -0.324173
Vermont      -0.945204
Florida      -1.566234
Oregon       -0.888214
Nevada       -1.142484
California   -0.137633
Idaho         1.617798
dtype: float64

***

用给定的值去填充

In [109]:
#定义函数后apply
fill_value={"West":0,"East":1}
fill_fun= lambda x:x.fillna(fill_value[x.name])
data.groupby(key).apply(fill_fun)

Ohio          0.000000
NewYork      -0.324173
Vermont       0.000000
Florida      -1.566234
Oregon       -0.888214
Nevada       -1.142484
California    1.000000
Idaho         1.617798
dtype: float64

***

**示例2：随机采样和排列**

In [110]:
#构造扑克牌，四种花色
suits=['H','C','S','D']
card_val=list(range(1,14))*4
name=['A']+list(range(2,11))+['J','Q','K']
cards=[]

In [111]:
for suit in suits:
    cards.extend(str(num)+suit for num in name)

In [112]:
deck=pd.Series(card_val,index=cards)

In [113]:
#随机抽取函数
def draw(x,n=5):
    return x.sample(n)

In [114]:
#花色选择函数
get_suit=lambda x:x[-1]

In [115]:
#每种花色抽取2张
deck.groupby(get_suit).apply(draw,n=2)

C  6C     6
   8C     8
D  JD    11
   KD    13
H  JH    11
   6H     6
S  9S     9
   QS    12
dtype: int64

***

**示例3: 分组加权平均,相关系数和线性回归**

1. 分组加权平均

In [116]:
#构建DataFrame数据
df = pd.DataFrame({'category':['a','a','a','a','b','b','b','b'],
'data':	np.random.randn(8),
'weights':	np.random.rand(8)})

In [117]:
#定义函数
get_avg= lambda x: np.average(x['data'],weights=x['weights'])

In [118]:
#分组计算列data根据weights的加权平均数
df.groupby('category').apply(get_avg)

category
a   -0.485201
b    0.447834
dtype: float64

***

2. 相关系数

In [119]:
#导入Yahoo！Finance数据集
close_px = pd.read_csv('stock_px2.csv',parse_dates=True,index_col=0)

In [120]:
#定义函数计算每列与SPX的相关系数
corr_spx=lambda x:x.corrwith(x['SPX'])

In [121]:
#利用datetime数据的year
get_year=lambda x: x.year

In [122]:
#计算日收益率
rates=close_px.pct_change().dropna()
rates

                AAPL      MSFT       XOM       SPX
Column1
2003-01-03  0.006757  0.001421  0.000684 -0.000484
2003-01-06  0.000000  0.017975  0.024624  0.022474
2003-01-07 -0.002685  0.019052 -0.033712 -0.006545
2003-01-08 -0.020188 -0.028272 -0.004145 -0.014086
2003-01-09  0.008242  0.029094  0.021159  0.019386
...              ...       ...       ...       ...
2011-10-10  0.051406  0.026286  0.036977  0.034125
2011-10-11  0.029526  0.002227 -0.000131  0.000544
2011-10-12  0.004747 -0.001481  0.011669  0.009795
2011-10-13  0.015515  0.008160 -0.010238 -0.002974
2011-10-14  0.033225  0.003311  0.022784  0.017380

[2213 rows x 4 columns]

In [123]:
#根据年份分组，计算各家公司与标普500相关系数
rates.groupby(get_year).apply(corr_spx)

          AAPL      MSFT       XOM  SPX
2003  0.541124  0.745174  0.661265  1.0
2004  0.374283  0.588531  0.557742  1.0
2005  0.467540  0.562374  0.631010  1.0
2006  0.428267  0.406126  0.518514  1.0
2007  0.508118  0.658770  0.786264  1.0
2008  0.681434  0.804626  0.828303  1.0
2009  0.707103  0.654902  0.797921  1.0
2010  0.710105  0.730118  0.839057  1.0
2011  0.691931  0.800996  0.859975  1.0

In [124]:
#计算任意两家公司相关系数
corr_12=lambda x:x['AAPL'].corr(x['MSFT'])

$\color{red}{注意：这里单列的相关系数用corr}$

In [125]:
rates.groupby(get_year).apply(corr_12)

2003    0.480868
2004    0.259024
2005    0.300093
2006    0.161735
2007    0.417738
2008    0.611901
2009    0.432738
2010    0.571946
2011    0.581987
dtype: float64

***

3. 分组线性回归

In [126]:
#线性回归函数
import	statsmodels.api	as	sm
def	regress(data,	yvar,	xvars):
				Y	=	data[yvar]
				X	=	data[xvars]
				X['intercept']	=	1.
				result	=	sm.OLS(Y,	X).fit()
				return	result.params

In [127]:
#分年份进行线性回归
rates.groupby(get_year).apply(regress,'AAPL',['SPX'])

           SPX  intercept
2003  1.195406   0.000710
2004  1.363463   0.004201
2005  1.766415   0.003246
2006  1.645496   0.000080
2007  1.198761   0.003438
2008  0.968016  -0.001110
2009  0.879103   0.002954
2010  1.052608   0.001261
2011  0.806605   0.001514

$\color{red}{疑问：为什么后面的列需要加[]?}$

### 10.4 透视表和交叉表

#### 10.4.1 透视表：根据一个或多个键对数据进行聚合，并根据行和列上的分组键将数据分配到各个矩形区域

pd.pivot_table(data,values=None,index=None,columns=None,aggfunc=None,margins=False)

1. index: 每个pivot_table必须有一个index，即行索引

In [128]:
#运用之前的小费数据集，以day和smoker作为索引分类聚合
tips.pivot_table(index=['day','smoker'])

                 size       tip   tip_pct  total_bill
day  smoker
Fri  No      2.250000  2.812500  0.151650   18.420000
     Yes     2.066667  2.714000  0.174783   16.813333
Sat  No      2.555556  3.102889  0.158048   19.661778
     Yes     2.476190  2.875476  0.147906   21.276667
Sun  No      2.929825  3.167895  0.160113   20.506667
     Yes     2.578947  3.516842  0.187250   24.120000
Thur No      2.488889  2.673778  0.160298   17.113111
     Yes     2.352941  3.030000  0.163863   19.190588

前面的列day为第一层索引，后面的列smoker为第二层索引

***

2. values: 即筛选出来我们需要进行分析的数据

In [129]:
#选取列tip_pct和size进行分析
tips.pivot_table(values=['tip_pct','size'],index=['day','time'])

                 size   tip_pct
day  time
Fri  Dinner  2.166667  0.158916
     Lunch   2.000000  0.188765
Sat  Dinner  2.517241  0.153152
Sun  Dinner  2.842105  0.166897
Thur Dinner  2.000000  0.159744
     Lunch   2.459016  0.161301

***

3. column类似于index可以设置列层次字段

In [130]:
#选取列smoker
tips.pivot_table(values=['tip_pct','size'],index=['day','time'],columns='smoker').dropna()

                 size             tip_pct
smoker             No       Yes        No       Yes
day  time
Fri  Dinner  2.000000  2.222222  0.139622  0.165347
     Lunch   3.000000  1.833333  0.187735  0.188937
Sat  Dinner  2.555556  2.476190  0.158048  0.147906
Sun  Dinner  2.929825  2.578947  0.160113  0.187250
Thur Lunch   2.500000  2.352941  0.160311  0.163863

***

4. aggfunc：设置对列进行的函数操作，默认为mean

In [131]:
#分别运用np.mean,np.sum
tips.pivot_table(values=['tip_pct','size'],index=['day','time'],aggfunc=[np.mean,np.sum]).dropna()

                 mean            sum
                 size   tip_pct size    tip_pct
day  time
Fri  Dinner  2.166667  0.158916   26   1.906993
     Lunch   2.000000  0.188765   14   1.321354
Sat  Dinner  2.517241  0.153152  219  13.324199
Sun  Dinner  2.842105  0.166897  216  12.684194
Thur Dinner  2.000000  0.159744    2   0.159744
     Lunch   2.459016  0.161301  150   9.839345

***

5. margins：添加分项小计

In [132]:
tips.pivot_table(values=['tip_pct','size'],index=['day','time'],columns='smoker',margins=True)

                 size                       tip_pct
smoker             No       Yes       All        No       Yes       All
day  time
Fri  Dinner  2.000000  2.222222  2.166667  0.139622  0.165347  0.158916
     Lunch   3.000000  1.833333  2.000000  0.187735  0.188937  0.188765
Sat  Dinner  2.555556  2.476190  2.517241  0.158048  0.147906  0.153152
Sun  Dinner  2.929825  2.578947  2.842105  0.160113  0.187250  0.166897
Thur Dinner  2.000000       NaN  2.000000  0.159744       NaN  0.159744
     Lunch   2.500000  2.352941  2.459016  0.160311  0.163863  0.161301
All          2.668874  2.408602  2.569672  0.159328  0.163196  0.160803

All为平均数

In [133]:
#fill_value填补NA值
tips.pivot_table('tip_pct',	index=['time',	'size',	'smoker'],columns='day',aggfunc=[len],	fill_value=0)

                   len
day                Fri Sat Sun Thur
time   size smoker
Dinner 1    No       0   1   0    0
            Yes      0   1   0    0
       2    No       3  25  27    1
            Yes      8  28  12    0
       3    No       0  12  11    0
            Yes      0   6   4    0
       4    No       0   7  16    0
            Yes      1   6   2    0
       5    No       0   0   2    0
            Yes      0   1   1    0
       6    No       0   0   1    0
Lunch  1    No       0   0   0    1
            Yes      1   0   0    0
       2    No       0   0   0   34
            Yes      5   0   0   13
       3    No       1   0   0    2
            Yes      0   0   0    2
       4    No       0   0   0    3
            Yes      0   0   0    2
       5    No       0   0   0    1
       6    No       0   0   0    3

#### 10.4.2 交叉表：用于计算分组频率的特殊透视表

pd.cosstab(x,y) #x,y可以是series也可以是数组

In [134]:
#tips数据中time和day，从而交叉统计个数
pd.crosstab(tips['time'],tips['day'])

day     Fri  Sat  Sun  Thur
time
Dinner   12   87   76     1
Lunch     7    0    0    61

In [135]:
#tips数据中time，day分别和smoker
pd.crosstab([tips['time'],tips['day']],tips['smoker'])

smoker       No  Yes
time   day
Dinner Fri    3    9
       Sat   45   42
       Sun   57   19
       Thur   1    0
Lunch  Fri    1    6
       Thur  44   17

***

**练习题1:groupby应用**

In [136]:
#导入drinks数据集
import pandas as pd
import numpy as np
drink=pd.read_csv('drinks.csv')

In [137]:
#
drink

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,AS
1,Albania,89,132,54,4.9,EU
2,Algeria,25,0,14,0.7,AF
3,Andorra,245,138,312,12.4,EU
4,Angola,217,57,45,5.9,AF
...,...,...,...,...,...,...
188,Venezuela,333,100,3,7.7,SA
189,Vietnam,111,2,1,2.0,AS
190,Yemen,6,0,0,0.1,AS
191,Zambia,32,19,4,2.5,AF
192,Zimbabwe,64,18,4,4.7,AF

In [139]:
#1.统计哪个大陆平均消耗的啤酒最多
drink['beer_servings'].groupby(drink['continent']).mean()

continent
AF     61.471698
AS     37.045455
EU    193.777778
OC     89.687500
SA    175.083333
Name: beer_servings, dtype: float64

In [140]:
#或者
drink.groupby('continent')['beer_servings'].mean()

continent
AF     61.471698
AS     37.045455
EU    193.777778
OC     89.687500
SA    175.083333
Name: beer_servings, dtype: float64

In [141]:
#2.打印出每个大陆(continent)的红酒消耗(wine_servings)的描述性统计值
drink["wine_servings"].groupby(drink['continent']).describe()

           count        mean        std  min   25%    50%     75%    max
continent
AF          53.0   16.264151  38.846419  0.0   1.0    2.0   13.00  233.0
AS          44.0    9.068182  21.667034  0.0   0.0    1.0    8.00  123.0
EU          45.0  142.222222  97.421738  0.0  59.0  128.0  195.00  370.0
OC          16.0   35.625000  64.555790  0.0   1.0    8.5   23.25  212.0
SA          12.0   62.416667  88.620189  1.0   3.0   12.0   98.50  221.0

In [142]:
#3.打印出每个大陆每种酒类别的消耗平均值
drink.groupby('continent').mean()

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
continent,,,,
AF,61.471698,16.339623,16.264151,3.007547
AS,37.045455,60.840909,9.068182,2.170455
EU,193.777778,132.555556,142.222222,8.617778
OC,89.687500,58.437500,35.625000,3.381250
SA,175.083333,114.750000,62.416667,6.308333

In [143]:
#4.打印出每个大陆每种酒类别的消耗中位数
drink.groupby('continent').median()

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
continent,,,,
AF,32.0,3.0,2.0,2.30
AS,17.5,16.0,1.0,1.20
EU,219.0,122.0,128.0,10.00
OC,52.5,37.0,8.5,1.75
SA,162.5,108.5,12.0,6.85

In [144]:
#5.打印出每个大陆对spirit饮品消耗的平均值，最大值和最小值
drink['spirit_servings'].groupby(drink['continent']).agg(['mean','max','min'])

                 mean  max  min
continent
AF          16.339623  152    0
AS          60.840909  326    0
EU         132.555556  373    0
OC          58.437500  254    0
SA         114.750000  302   25

***

In [147]:
#6.按照大陆和国家进行聚合分析均值，选取每个地区啤酒消耗前三名的国家
def rank(x,n=3):
    return x.sort_values('beer_servings')[-n:]

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
62,Gabon,347,98,59,8.9,AF
45,Czech Republic,361,170,134,11.8,EU
117,Namibia,376,3,1,6.8,AF

In [152]:
drink.groupby('continent').apply(rank,n=3)

                          country  beer_servings  spirit_servings  \
continent
AF        159        South Africa            225               76
          62                Gabon            347               98
          117             Namibia            376                3
AS        87           Kazakhstan            124              246
          138         South Korea            140               16
          141  Russian Federation            247              326
EU        98            Lithuania            343              244
          65              Germany            346              117
          45       Czech Republic            361              170
OC        121         New Zealand            203               79
          8             Australia            261               72
          129               Palau            306               63
SA        132            Paraguay            213              117
          23               Brazil            245              145
          188           Venezuela            333              100

               wine_servings  total_litres_of_pure_alcohol continent
continent
AF        159             81                           8.2        AF
          62              59                           8.9        AF
          117              1                           6.8        AF
AS        87              12                           6.8        AS
          138              9                           9.8        AS
          141             73                          11.5        AS
EU        98              56                          12.9        EU
          65             175                          11.3        EU
          45             134                          11.8        EU
OC        121            175                           9.3        OC
          8              212                          10.4        OC
          129             23                           6.9        OC
SA        132             74                           7.3        SA
          23              16                           7.2        SA
          188              3                           7.7        SA

In [159]:
#按照大陆和国家构建透视表
drink_table=drink.pivot_table(index=['continent','country'])
drink_table

                        beer_servings  spirit_servings  \
continent country
AF        Algeria                  25                0
          Angola                  217               57
          Benin                    34                4
          Botswana                173               35
          Burkina Faso             25                7
...                               ...              ...
SA        Paraguay                213              117
          Peru                    163              160
          Suriname                128              178
          Uruguay                 115               35
          Venezuela               333              100

                        total_litres_of_pure_alcohol  wine_servings
continent country
AF        Algeria                                0.7             14
          Angola                                 5.9             45
          Benin                                  1.1             13
          Botswana                               5.4             35
          Burkina Faso                           4.3              7
...                                              ...            ...
SA        Paraguay                               7.3             74
          Peru                                   6.1             21
          Suriname                               5.6              7
          Uruguay                                6.6            220
          Venezuela                              7.7              3

[170 rows x 4 columns]